experiment_data/ycsb/Tapir/run-rper100-hst3-srv9-thr3-this2.log
YCSB Client 0.1
Command line: -P workloads/workload100 -t -db com.yahoo.ycsb.db.TapirClient -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=2 -p measurement.type=histogram -p histogram.buckets=25 -threads 3 -p operationcount=1000000
Loading workload...
Starting test.
Database validation succeeded
[OVERALL], RunTime(ms), 467121.0
[OVERALL], Throughput(ops/sec), 2140.77080670747
[READ], Operations, 999999
[READ], AverageLatency(us), 278.07123007123005
[READ], MinLatency(us), 155
[READ], MaxLatency(us), 9659
[READ], 95thPercentileLatency(ms), 0
[READ], 99thPercentileLatency(ms), 0
[READ], Return=0, 999998
[READ], Return=1, 1
[READ], 0, 999737
[READ], 1, 193
[READ], 2, 38
[READ], 3, 13
[READ], 4, 8
[READ], 5, 3
[READ], 6, 3
[READ], 7, 2
[READ], 8, 0
[READ], 9, 2
[READ], 10, 0
[READ], 11, 0
[READ], 12, 0
[READ], 13, 0
[READ], 14, 0
[READ], 15, 0
[READ], 16, 0
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[ABORT], Operations, 1
[ABORT], AverageLatency(us), 95.0
[ABORT], MinLatency(us), 95
[ABORT], MaxLatency(us), 95
[ABORT], 95thPercentileLatency(ms), 0
[ABORT], 99thPercentileLatency(ms), 0
[ABORT], Return=0, 1
[ABORT], 0, 1
[ABORT], 1, 0
[ABORT], 2, 0
[ABORT], 3, 0
[ABORT], 4, 0
[ABORT], 5, 0
[ABORT], 6, 0
[ABORT], 7, 0
[ABORT], 8, 0
[ABORT], 9, 0
[ABORT], 10, 0
[ABORT], 11, 0
[ABORT], 12, 0
[ABORT], 13, 0
[ABORT], 14, 0
[ABORT], 15, 0
[ABORT], 16, 0
[ABORT], 17, 0
[ABORT], 18, 0
[ABORT], 19, 0
[ABORT], 20, 0
[ABORT], 21, 0
[ABORT], 22, 0
[ABORT], 23, 0
[ABORT], 24, 0
[ABORT], >25, 0
[COMMIT], Operations, 999998
[COMMIT], AverageLatency(us), 1114.6827923655846
[COMMIT], MinLatency(us), 1006
[COMMIT], MaxLatency(us), 503056
[COMMIT], 95thPercentileLatency(ms), 1
[COMMIT], 99thPercentileLatency(ms), 1
[COMMIT], Return=0, 999998
[COMMIT], 0, 0
[COMMIT], 1, 999737
[COMMIT], 2, 130
[COMMIT], 3, 67
[COMMIT], 4, 30
[COMMIT], 5, 8
[COMMIT], 6, 4
[COMMIT], 7, 9
[COMMIT], 8, 8
[COMMIT], 9, 2
[COMMIT], 10, 0
[COMMIT], 11, 0
[COMMIT], 12, 0
[COMMIT], 13, 0
[COMMIT], 14, 0
[COMMIT], 15, 0
[COMMIT], 16, 0
[COMMIT], 17, 0
[COMMIT], 18, 0
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 3
[START], Operations, 999999
[START], AverageLatency(us), 1.0237810237810239
[START], MinLatency(us), 0
[START], MaxLatency(us), 106
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 999999
[START], 0, 999999
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0