experiment_data/ycsb/Tapir/run-rper100-hst6-srv3-thr5-this0.log
YCSB Client 0.1
Command line: -P workloads/workload100 -t -db com.yahoo.ycsb.db.TapirClient -s -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=0 -p measurement.type=histogram -p histogram.buckets=25 -threads 5 -p operationcount=150000
Loading workload...
Starting test.
 0 sec: 0 operations; 
 10 sec: 20636 operations; 2057.63 current ops/sec; [READ AverageLatency(us)=662.14] [COMMIT AverageLatency(us)=1744.61] [START AverageLatency(us)=1] 
 20 sec: 40979 operations; 2033.89 current ops/sec; [READ AverageLatency(us)=647.01] [COMMIT AverageLatency(us)=1804.67] [START AverageLatency(us)=0.99] 
 30 sec: 61081 operations; 2010 current ops/sec; [READ AverageLatency(us)=662.26] [COMMIT AverageLatency(us)=1818.28] [START AverageLatency(us)=0.98] 
 40 sec: 81388 operations; 2030.7 current ops/sec; [READ AverageLatency(us)=651.98] [COMMIT AverageLatency(us)=1804.56] [START AverageLatency(us)=0.97] 
 50 sec: 101650 operations; 2026 current ops/sec; [READ AverageLatency(us)=665.88] [COMMIT AverageLatency(us)=1796.83] [START AverageLatency(us)=0.95] 
 60 sec: 121850 operations; 2020 current ops/sec; [READ AverageLatency(us)=686.07] [COMMIT AverageLatency(us)=1784.13] [START AverageLatency(us)=0.94] 
 70 sec: 146132 operations; 2427.96 current ops/sec; [READ AverageLatency(us)=562.82] [COMMIT AverageLatency(us)=1491.29] [START AverageLatency(us)=0.94] 
 71 sec: 150000 operations; 2351.37 current ops/sec; [READ AverageLatency(us)=444.11] [COMMIT AverageLatency(us)=1241.82] [START AverageLatency(us)=0.91] 
Database validation succeeded
[OVERALL], RunTime(ms), 71679.0
[OVERALL], Throughput(ops/sec), 2092.663123090445
[READ], Operations, 150000
[READ], AverageLatency(us), 640.7623066666666
[READ], MinLatency(us), 153
[READ], MaxLatency(us), 8874
[READ], 95thPercentileLatency(ms), 1
[READ], 99thPercentileLatency(ms), 3
[READ], Return=0, 150000
[READ], 0, 122212
[READ], 1, 21058
[READ], 2, 4453
[READ], 3, 1463
[READ], 4, 516
[READ], 5, 204
[READ], 6, 60
[READ], 7, 20
[READ], 8, 14
[READ], 9, 0
[READ], 10, 0
[READ], 11, 0
[READ], 12, 0
[READ], 13, 0
[READ], 14, 0
[READ], 15, 0
[READ], 16, 0
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[COMMIT], Operations, 150000
[COMMIT], AverageLatency(us), 1729.1469
[COMMIT], MinLatency(us), 1032
[COMMIT], MaxLatency(us), 503323
[COMMIT], 95thPercentileLatency(ms), 3
[COMMIT], 99thPercentileLatency(ms), 5
[COMMIT], Return=0, 150000
[COMMIT], 0, 0
[COMMIT], 1, 117244
[COMMIT], 2, 17905
[COMMIT], 3, 8021
[COMMIT], 4, 3892
[COMMIT], 5, 1763
[COMMIT], 6, 723
[COMMIT], 7, 309
[COMMIT], 8, 100
[COMMIT], 9, 27
[COMMIT], 10, 10
[COMMIT], 11, 3
[COMMIT], 12, 1
[COMMIT], 13, 0
[COMMIT], 14, 1
[COMMIT], 15, 0
[COMMIT], 16, 0
[COMMIT], 17, 0
[COMMIT], 18, 0
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 1
[START], Operations, 150000
[START], AverageLatency(us), 0.9637066666666667
[START], MinLatency(us), 0
[START], MaxLatency(us), 77
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 150000
[START], 0, 150000
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0