experiment_data/ycsb/Tapir/run-rper100-hst6-srv3-thr6-this1.log
YCSB Client 0.1
Command line: -P workloads/workload100 -t -db com.yahoo.ycsb.db.TapirClient -s -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=1 -p measurement.type=histogram -p histogram.buckets=25 -threads 6 -p operationcount=150000
Loading workload...
Starting test.
 0 sec: 0 operations; 
 10 sec: 19871 operations; 1981.55 current ops/sec; [READ AverageLatency(us)=1113.56] [COMMIT AverageLatency(us)=1889.21] [START AverageLatency(us)=0.99] 
 20 sec: 39184 operations; 1930.72 current ops/sec; [READ AverageLatency(us)=1131.29] [COMMIT AverageLatency(us)=1968.82] [START AverageLatency(us)=0.96] 
 30 sec: 58870 operations; 1968.6 current ops/sec; [READ AverageLatency(us)=1101.79] [COMMIT AverageLatency(us)=1939.83] [START AverageLatency(us)=0.94] 
 40 sec: 78206 operations; 1933.41 current ops/sec; [READ AverageLatency(us)=1144.43] [COMMIT AverageLatency(us)=1953.78] [START AverageLatency(us)=0.92] 
 50 sec: 97496 operations; 1929 current ops/sec; [READ AverageLatency(us)=1147.8] [COMMIT AverageLatency(us)=1957.21] [START AverageLatency(us)=0.93] 
 60 sec: 116988 operations; 1949.01 current ops/sec; [READ AverageLatency(us)=1108.36] [COMMIT AverageLatency(us)=1964.85] [START AverageLatency(us)=0.94] 
 70 sec: 136553 operations; 1956.5 current ops/sec; [READ AverageLatency(us)=1101.94] [COMMIT AverageLatency(us)=1959.37] [START AverageLatency(us)=0.95] 
 77 sec: 150000 operations; 1883.33 current ops/sec; [READ AverageLatency(us)=1131.29] [COMMIT AverageLatency(us)=1969.34] [START AverageLatency(us)=0.96] 
Database validation succeeded
[OVERALL], RunTime(ms), 77174.0
[OVERALL], Throughput(ops/sec), 1943.6597817917952
[READ], Operations, 150000
[READ], AverageLatency(us), 1122.0779533333334
[READ], MinLatency(us), 173
[READ], MaxLatency(us), 17404
[READ], 95thPercentileLatency(ms), 4
[READ], 99thPercentileLatency(ms), 7
[READ], Return=0, 150000
[READ], 0, 104976
[READ], 1, 21347
[READ], 2, 9564
[READ], 3, 5531
[READ], 4, 3367
[READ], 5, 2108
[READ], 6, 1330
[READ], 7, 763
[READ], 8, 437
[READ], 9, 268
[READ], 10, 156
[READ], 11, 64
[READ], 12, 47
[READ], 13, 22
[READ], 14, 12
[READ], 15, 4
[READ], 16, 3
[READ], 17, 1
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[COMMIT], Operations, 150000
[COMMIT], AverageLatency(us), 1949.3338866666666
[COMMIT], MinLatency(us), 662
[COMMIT], MaxLatency(us), 18994
[COMMIT], 95thPercentileLatency(ms), 5
[COMMIT], 99thPercentileLatency(ms), 8
[COMMIT], Return=0, 150000
[COMMIT], 0, 63076
[COMMIT], 1, 40887
[COMMIT], 2, 17699
[COMMIT], 3, 10695
[COMMIT], 4, 6796
[COMMIT], 5, 4429
[COMMIT], 6, 2686
[COMMIT], 7, 1656
[COMMIT], 8, 985
[COMMIT], 9, 544
[COMMIT], 10, 274
[COMMIT], 11, 135
[COMMIT], 12, 92
[COMMIT], 13, 31
[COMMIT], 14, 9
[COMMIT], 15, 2
[COMMIT], 16, 2
[COMMIT], 17, 1
[COMMIT], 18, 1
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 0
[START], Operations, 150000
[START], AverageLatency(us), 0.94678
[START], MinLatency(us), 0
[START], MaxLatency(us), 59
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 150000
[START], 0, 150000
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0